{
    "dua": [
        {
            "id": 1,
            "dua_arabic": "\n إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ",
            "transliteration": "\n Inna Ma’ iya Rabbi Sayahdini",
            "translation": "\n Indeed my Lord is with me, He will show me the way out.",
            "info": "\n Quran 26:62 \n Qaala Musa (A.S)"
        },
        {
            "id": 2,
            "dua_arabic": "\n رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍۢ فَقِيرٌۭ",
            "transliteration": "\n Rabbi inni lima anzalta ilayya min khairin faqir",
            "translation": "\n My Lord! Truly, I am in great need of whatever  good You bestow on me.",
            "info": "\n Quran 28:24 \n Read story of Musa (A.S)"
        },
        {
            "id": 3,
            "dua_arabic": "\n رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا ",
            "transliteration": "\n Rabbir hamhuma kama Rabbayani Sagheera",
            "translation": "\n My Lord, have mercy upon them as they brought me up [when I was] small.",
            "info": "\n Quran 17:24 \n In Sahih Muslim 1631, Abu Huraira (ra) reported Allah’s Messenger ﷺ as saying: When a man dies, his acts come to an end except for three: 1) recurring charity, 2) knowledge (by which people) benefit, 3)  a pious son who prays for him (for the deceased)."
        },
        {
            "id": 4,
            "dua_arabic": "\n رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ",
            "transliteration": "\n Rabbighfir warham wa-anta khayru-rahimeen",
            "translation": "\n My Lord, forgive and have mercy, and you are the best of the merciful.",
            "info": "\n Quran 23:118"
        },
        {
            "id": 5,
            "dua_arabic": "\n رَبَّنَا آتِنَا فِىْ الدُّنْيَا حَسَنَةً وَفِىْ الآخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ",
            "transliteration": "\n Rabbana atina fid dunya hasanatan wa fil aakhirati hasanatan waqina ‘adhaban-naar",
            "translation": "\n Our Lord, give us in this world [that which is] good and in the hereafter [that which is] good and protect us from the punishment of the Fire",
            "info": "\n Quran 2:101 \n Anas reported that Allah's Messenger ﷺ visited a person from amongst the Muslims in order to inquire (about his health) who had grown feeble like the chicken. Allah's Messenger ﷺ said: Did you supplicate for anything or beg of Him about that? He said: Yes. I used to utter (these words): Impose punishment upon me earlier in this world, what Thou art going to impose upon me in the Hereafter. Thereupon Allah's Messengerﷺ said: Hallowed be Allah, you have neither the power nor forbearance to take upon yourself (the burden of His Punishment). Why did you not say this: [above Du'a]. He (the Holy Prophet) made this supplication (for him) and he was all right.\n Sahih Muslim 2688a"
        },
        {
            "id": 6,
            "dua_arabic": "\n رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا",
            "transliteration": "\n rabbana la tuakhizna inna sina aw akhta’ana",
            "translation": "\n Our Lord, condemn us not if we have forgotten or made mistakes",
            "info": "\n Quran 2:286"
        },
        {
            "id": 7,
            "dua_arabic": "\n رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ",
            "transliteration": "\n Rabbanaa wa laa tahmil-‘alainaaa isran kamaa hamaltahoo ‘alal-lazeena min qablinaa; Rabbanaa wa laa tuhammilnaa maa laa taaqata lanaa bih; wa’fu ‘annaa waghfir lanaa warhamnaa; Anta mawlaanaa fansurnaa ‘alal qawmil kaafireen",
            "translation": "\n Our Lord! Lay not on us a burden such as You laid on those gone before us. Our Lord! Lay not on us burdens which we do not have the power to bear. And overlook our faults, and forgive us, and have mercy upon us. You are our Guardian; so grant us victory against the unbelieving folk.",
            "info": "\n Quran 2:286 \n Abd al-Rahman b. Yazid said: I asked Abu Mas’ud while he was making circumambulation of the Ka’bah (about the recitation of some verses from the Qur’an). He said: The Messenger of Allah (ﷺ) said: If anyone recited two verses from the last of Surah al-Baqarah at night, they will be sufficient for him.\n Sunan Abi Dawud #1397 - Sahih by Al-Albani."
        },
        {
            "id": 8,
            "dua_arabic": "\n اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
            "transliteration": "\n Allahumma inni as’aluka al-Jannah wa a'oodhu bika min an-naar",
            "translation": "\n O Allah, I ask You for paradise, and I seek refuge in You from the fire.",
            "info": "\n Anas bin Malik narrated that the Messenger of Allah (s.a.w) said: \"Whoever asks Allah (s.w.t) Paradise three times, Paradise says: 'O Allah, admit him into Paradise', and whoever seeks refuge from the Fire three times, the Fire says: 'O Allah, save him from the Fire.'\" \n Jami` at-Tirmidhi 2572 "
        },
        {
            "id": 9,
            "dua_arabic": "\nٌ اللَّهُمَّ إِنِّيْ أَسْأَلُكَ حُسْنَ الْخَاتِمَةِ",
            "transliteration": "\n Allahumma inni as’aluka husnal khatimah",
            "translation": "\n O Allah, I ask You for a good end to my life.",
            "info": "\n The Prophet (S.AW.) said, \" Whoever declares ‘there is no God but Allah’ seeking the countenance of Allah as his last deed, he will enter Paradise. Whoever gives in charity seeking the countenance of Allah as his last deed, he will enter Paradise.\" \n Musnad Ahmad 22813; Sahih by Albani "
        },
        
        
        {
            "id": 10,
            "dua_arabic": "\n اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ",
            "transliteration": "\n Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunya wal-akhirah",
            "translation": "\n O Allah, I ask You for forgiveness and well-being in this world and in the hereafter.",
            "info": "\n It was narrated that Ibn ‘Umar said: “The Messenger of Allah (SAW) never abandoned these supplications, every morning and evening: Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunya wal-akhirah. Allahumma inni as’alukal-‘afwa wal-‘afiyah fi dini wa dunyaya wa ahli wa mali. Allahum-mastur ‘awrati, wa amin raw’ati wahfazni min bayni yadayya, wa min khalfi, wa ‘an yamini wa ‘an shimali, wa min fawqi, wa ‘audhu bika an ughtala min tahti \n Grade:Sahih (Darussalam) In-book reference : Book 34, Hadith 45"
        },
        
        
        {
            "id": 11,
            "dua_arabic": "\n اللَّهُمَّ أَعِنِّيْ عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
            "transliteration": "\n Allahumma a’inni ala zikrika was shukrika wa husni ibaadatik",
            "translation": "\n O Allah, help me to remember You, to give thanks to You, and to worship You in the best manner",
            "info": "\n The Messenger of Allah (ﷺ) took hold of my hand and said, “O Mu’adh! By Allah I love you, so I advise you to never forget to recite after every prayer: \" Allahumma a’inni ala dhikrika, wa shukrika, wa husni ‘ibadatika \". \n Abu Dawud and An- Nasa’i (Riyad as-Salihin 384) "
        },
        {
            "id": 12,
            "dua_arabic": "\n اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
            "transliteration": "\n Allaahumma ‘innee ‘a’oodu bika minal-hammi walhazani, wal’ajzi walkasali, walbukhli waljubni, wa dhala’id-dayni wa ghalabatir-rijaal",
            "translation": "\n O Allah, I seek refuge in You from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being overcome by debt and overpowered by men (i.e. others).",
            "info": "\n Dua for worry and anxiety. \n Al-Bukhari 7/158"
        }
        {
            "id": 13,
            "dua_arabic": "\n يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
            "transliteration": "\n Ya Muqallib al-quloob thabbit qalbi 'ala deenik",
            "translation": "\n O! turner of hearts, keep my heart steadfast on your religion.",
            "info": "\n 'Anas narrated: \"The Messenger of Allah (s.a.w) would often say: Ya Muqallibal-qulub, thabbit qalbi 'ala dinik('O Changer of the Hearts! Strengthen my heart upon Your Religion.)' So I said: 'O Prophet of Allah! We believe in you and what you have come with, but do you fear for us?' He said: 'Yes. Indeed the hearts are between two Fingers of Allah's Fingers, He changes them as He wills.'\" "
        },
        {
            "id": 14,
            "dua_arabic": "\n یَاحَیُّ یَا قَیُّوْمُ بِرَحْمَتِکَ اَسْتَغِیْثُ أَصْلِحْ لِیْ شَاْنِیْ کُلَّہٗ وَلَا تَکِلْنِیْ اِلٰی نَفْسِیْ طَرْفَةَ عَیْنٍ",
            "transliteration": "\n Ya Hayyu Ya Qayyum, birahmatika astaghitsu, aslih li sha'ni kullahu, wa la takilni ila nafsi tarfata ‘aini",
            "translation": "\n O The Ever-Living, O The Self-Subsisting, I seek help through Your Mercy. Set right all my affairs and do not leave me to myself even for the blinking of an eye.",
            "info": "\n This dua was narrated in a sahih hadith from Anas ibn Malik (RA), who said: The Prophet (S.A.W) said to Fatimah (RA): \" What could prevent you from listening to the advice I give you? You should say when morning comes and when evening comes: Ya Hayyu ya Qayyum, bi rahmatika astaghith, aslih li shani kullahu, wa la takilni ila nafsi tarfat ‘ayn\" \n (Narrated by an-Nasai in as-Sunan al-Kubra (6/147) and in ‘Amal al-Yawm wa’l-Laylah (no. 46); by al-Hakim in al-Mustadrak (1/730); by al-Bayhaqi in al-Asma’ was-Sifaat (112), and others.) "
        },
        {
            "id": 15,
            "dua_arabic": "\n أسْتَغْفِرُ اللهَ رَبي مِنْ كُلِ ذَنبٍ وَأتُوبُ إلَيهِ",
            "transliteration": "\n Astaghfirullah rabbi min kulli zambin wa’toobu ilaiyh",
            "translation": "\n I ask forgiveness of my sins from Allah who is my Lord and I turn towards Him.",
            "info": "\n Narrated Az-Zuhri: Regarding Quran 47:19: 'And seek forgiveness for your sins, and also for the believing men and women’, that the Messenger of Allah ﷺ said: \"Indeed I ask Allah for forgiveness seventy times a day.\"\nTirmidhi 3259"
        }
    ]
}
