{
    "dua": [
        {
            "id": 1,
	    "dua_arabic": "\n رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍۢ فَقِيرٌۭ"
	    "transliteration": "\n Rabbi inni lima anzalta ilayya min khairin faqir",
	    "translation": "\n My Lord! Truly, I am in great need of whatever  good You bestow on me.",
	    "info": "\n Quran 28:24 \n Read story of Musa (A.S)"
	},
	{
            "id": 2,
	    "dua_arabic": "\n إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ"
	    "transliteration": "\n Inna Ma’ iya Rabbi Sayahdini",
	    "translation": "\n Indeed my Lord is with me, He will show me the way out.",
	    "info": "\n Quran 26:62 \n Qaala Musa (A.S)"
	},
	{
            "id": 3,
	    "dua_arabic": "\n اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ"
	    "transliteration": "\n Allahumma inni as’aluka al-Jannah wa a'oodhu bika min an-naar",
	    "translation": "\n O Allah, I ask You for paradise, and I seek refuge in You from the fire.",
	    "info": "\n Anas bin Malik narrated that the Messenger of Allah (s.a.w) said: \"Whoever asks Allah (s.w.t) Paradise three times, Paradise says: 'O Allah, admit him into Paradise', and whoever seeks refuge from the Fire three times, the Fire says: 'O Allah, save him from the Fire.'\" \n Jami` at-Tirmidhi 2572 "
	},
	{
            "id": 4,
	    "dua_arabic": "\n یَاحَیُّ یَا قَیُّوْمُ بِرَحْمَتِکَ اَسْتَغِیْثُ أَصْلِحْ لِیْ شَاْنِیْ کُلَّہٗ وَلَا تَکِلْنِیْ اِلٰی نَفْسِیْ طَرْفَةَ عَیْنٍ"
	    "transliteration": "\n Ya Hayyu Ya Qayyum, birahmatika astaghitsu, aslih li sha'ni kullahu, wa la takilni ila nafsi tarfata ‘aini",
	    "translation": "\n O The Ever-Living, O The Self-Subsisting, I seek help through Your Mercy. Set right all my affairs and do not leave me to myself even for the blinking of an eye.",
	    "info": "\n This dua was narrated in a sahih hadith from Anas ibn Malik (RA), who said: The Prophet (S.A.W) said to Fatimah (RA): \" What could prevent you from listening to the advice I give you? You should say when morning comes and when evening comes: Ya Hayyu ya Qayyum, bi rahmatika astaghith, aslih li shani kullahu, wa la takilni ila nafsi tarfat ‘ayn\" \n (Narrated by an-Nasai in as-Sunan al-Kubra (6/147) and in ‘Amal al-Yawm wa’l-Laylah (no. 46); by al-Hakim in al-Mustadrak (1/730); by al-Bayhaqi in al-Asma’ was-Sifaat (112), and others.) "
	},
	{
            "id": 5,
	    "dua_arabic": "\nٌ اللَّهُمَّ إِنِّيْ أَسْأَلُكَ حُسْنَ الْخَاتِمَةِ"
	    "transliteration": "\n Allahumma inni as’aluka husnal khatimah",
	    "translation": "\n O Allah, I ask You for a good end to my life.",
	    "info": "\n The Prophet (S.AW.) said, \" Whoever declares ‘there is no God but Allah’ seeking the countenance of Allah as his last deed, he will enter Paradise. Whoever gives in charity seeking the countenance of Allah as his last deed, he will enter Paradise.\" \n Musnad Ahmad 22813; Sahih by Albani "
	}
   ]
}
